# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementSet..::..Erase Method
ElementSet Class See Also
---
Removes a specified element from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Element item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Element _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Element^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ElementThe element to be erased.
# ### Return Value
The number of elements that were erased from the set.
# See Also
ElementSet Class
Autodesk.Revit.DB Namespace